In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [11]:
myData = randn(3,4)

In [12]:
myData

array([[-0.87883957,  0.15697675, -0.73428402,  0.33585833],
       [-1.88435199,  0.05177554, -0.61345554,  0.66919437],
       [ 0.77810476,  1.08673061,  0.12944336, -0.37249884]])

### Data frame

In [13]:
myDataFrame = pd.DataFrame(myData, ['R1', 'R2', 'R3'], ['C1', 'C2', 'C3', 'C4'])

In [14]:
myDataFrame

          C1        C2        C3        C4
R1 -0.878840  0.156977 -0.734284  0.335858
R2 -1.884352  0.051776 -0.613456  0.669194
R3  0.778105  1.086731  0.129443 -0.372499

### Select column

In [15]:
myDataFrame['C1']

R1   -0.878840
R2   -1.884352
R3    0.778105
Name: C1, dtype: float64

In [16]:
myDataFrame[['C1', 'C3']]

          C1        C3
R1 -0.878840 -0.734284
R2 -1.884352 -0.613456
R3  0.778105  0.129443

### Add new column

In [19]:
myDataFrame['C5'] = myDataFrame['C2'] * myDataFrame['C4']

In [20]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.878840  0.156977 -0.734284  0.335858  0.052722
R2 -1.884352  0.051776 -0.613456  0.669194  0.034648
R3  0.778105  1.086731  0.129443 -0.372499 -0.404806

### Delete column

In [26]:
# myDataFrame.drop('C2') #example if you don't use axis=1

In [22]:
myDataFrame.drop('C2', axis=1)

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648
R3  0.778105  0.129443 -0.372499 -0.404806

In [23]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.878840  0.156977 -0.734284  0.335858  0.052722
R2 -1.884352  0.051776 -0.613456  0.669194  0.034648
R3  0.778105  1.086731  0.129443 -0.372499 -0.404806

In [24]:
myDataFrame.drop('C2', axis=1, inplace=True)

In [25]:
myDataFrame

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648
R3  0.778105  0.129443 -0.372499 -0.404806

# Subselection

In [27]:
myDataFrame.loc['R2']

C1   -1.884352
C3   -0.613456
C4    0.669194
C5    0.034648
Name: R2, dtype: float64

In [29]:
myDataFrame.iloc[1]

C1   -1.884352
C3   -0.613456
C4    0.669194
C5    0.034648
Name: R2, dtype: float64

In [30]:
myDataFrame.loc[['R1', 'R2'], ['C4', 'C5']]

          C4        C5
R1  0.335858  0.052722
R2  0.669194  0.034648

# Conditionals in Pandas

In [31]:
myDataFrame

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648
R3  0.778105  0.129443 -0.372499 -0.404806

In [32]:
myDataFrame > 0

       C1     C3     C4     C5
R1  False  False   True   True
R2  False  False   True   True
R3   True   True  False  False

In [33]:
myDataFrame[myDataFrame > 0]

          C1        C3        C4        C5
R1       NaN       NaN  0.335858  0.052722
R2       NaN       NaN  0.669194  0.034648
R3  0.778105  0.129443       NaN       NaN

In [34]:
myDataFrame[myDataFrame['C3'] > 0]

          C1        C3        C4        C5
R3  0.778105  0.129443 -0.372499 -0.404806

In [35]:
myDataFrame[myDataFrame['C5'] > 0]

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648

# Multiple conditionals in Pandas

In [36]:
myDataFrame

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648
R3  0.778105  0.129443 -0.372499 -0.404806

In [39]:
myDataFrame[(myDataFrame['C1'] > 0) & (myDataFrame['C5'] > 0)]

Empty DataFrame
Columns: [C1, C3, C4, C5]
Index: []

In [41]:
myDataFrame[(myDataFrame['C3'] > 0) & (myDataFrame['C1'] > 0)]

          C1        C3        C4        C5
R3  0.778105  0.129443 -0.372499 -0.404806

In [42]:
myDataFrame[(myDataFrame['C1'] > 0) | (myDataFrame['C5'] > 0)]

          C1        C3        C4        C5
R1 -0.878840 -0.734284  0.335858  0.052722
R2 -1.884352 -0.613456  0.669194  0.034648
R3  0.778105  0.129443 -0.372499 -0.404806

In [43]:
myDataFrame[(myDataFrame['C1'] > 0) | (myDataFrame['C3'] > 0)]

          C1        C3        C4        C5
R3  0.778105  0.129443 -0.372499 -0.404806

In [44]:
True and False

False

# New index to DataFrame

In [45]:
myNewIndex = ['row1', 'row2', 'row3']

In [46]:
myNewIndex

['row1', 'row2', 'row3']

In [47]:
myDataFrame['NewIndex'] = myNewIndex

In [48]:
myDataFrame

          C1        C3        C4        C5 NewIndex
R1 -0.878840 -0.734284  0.335858  0.052722     row1
R2 -1.884352 -0.613456  0.669194  0.034648     row2
R3  0.778105  0.129443 -0.372499 -0.404806     row3

In [49]:
myDataFrame.set_index('NewIndex')

                C1        C3        C4        C5
NewIndex
row1     -0.878840 -0.734284  0.335858  0.052722
row2     -1.884352 -0.613456  0.669194  0.034648
row3      0.778105  0.129443 -0.372499 -0.404806

In [50]:
myDataFrame

          C1        C3        C4        C5 NewIndex
R1 -0.878840 -0.734284  0.335858  0.052722     row1
R2 -1.884352 -0.613456  0.669194  0.034648     row2
R3  0.778105  0.129443 -0.372499 -0.404806     row3

In [51]:
#use inplace=True to make changes permanent